Repository: xlsdg/flower-password-swift
Catalog: FlowerPassword/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# autoLaunchFailed
source: Failed to configure launch at login. Please check system permissions.
zh_hans: 无法配置开机自启功能,请检查系统权限设置。
zh_hant: 無法配置開機自啟功能,請檢查系統權限設定。

source: Auto-Type
zh_hans: 自动键入
zh_hant: 自動鍵入

# autoTypePermissionDetail
source: Allow FlowerPassword in System Settings → Privacy & Security → Accessibility, then enable Auto-Type again.
zh_hans: 请在「系统设置 → 隐私与安全性 → 辅助功能」中允许 FlowerPassword,然后重新开启自动键入。
zh_hant: 請在「系統設定 → 隱私權與安全性 → 輔助使用」中允許 FlowerPassword,然後重新開啟自動鍵入。

# autoTypePermissionRequired
source: Accessibility Permission Required
zh_hans: 需要辅助功能权限
zh_hant: 需要輔助功能權限

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Current version: %@
zh_hans: 当前版本:%@
zh_hant: 目前版本:%@

source: Distinction Code
zh_hans: 区分代号
zh_hant: 區分代號

# distinctionCodeHint
source: Distinction Code: A short code for different accounts, e.g., "taobao" or "tb".
zh_hans: 区分代号:用于区别不同用途密码的简短代号,如淘宝账号可用“taobao”或“tb”等。
zh_hant: 區分代號:用於區別不同用途密碼的簡短代號,如淘寶帳號可用「taobao」或「tb」等。

# generatePassword
source: Generate Password (Click to Copy)
zh_hans: 生成密码(点击复制)
zh_hant: 生成密碼(點擊複製)

source: Global Shortcut
zh_hans: 全局快捷键
zh_hant: 全域快速鍵

source: Install and Relaunch
zh_hans: 安装并重启
zh_hant: 安裝並重啟

source: Language
zh_hans: 语言
zh_hant: 語言

# languageAuto
source: Auto
zh_hans: 自动
zh_hant: 自動

source: Later
zh_hans: 稍后
zh_hant: 稍後

source: Launch at Login
zh_hans: 开机自启
zh_hant: 開機自啟

source: Memory Password
zh_hans: 记忆密码
zh_hant: 記憶密碼

# memoryPasswordHint
source: Memory Password: A simple password to generate strong passwords.
zh_hans: 记忆密码:可选择一个简单易记的密码,用于生成其他高强度密码。
zh_hant: 記憶密碼:可選擇一個簡單易記的密碼,用於生成其他高強度密碼。

source: Official Website
zh_hans: 官网地址
zh_hant: 官網地址

# officialWebsiteHint
source: Official Website:
zh_hans: 官网地址:
zh_hant: 官網地址:

source: OK
zh_hans: 确定
zh_hant: 確定

source: Open Download Page
zh_hans: 打开下载页面
zh_hant: 開啟下載頁面

# passwordCopied
source: Password copied to clipboard
zh_hans: 密码已复制到剪贴板
zh_hant: 密碼已複製到剪貼簿

source: Password Length
zh_hans: 密码长度
zh_hant: 密碼長度

# passwordLengthValue
source: %@ chars
zh_hans: %@位
zh_hant: %@位

source: Prefix
zh_hans: 区分代号前缀
zh_hant: 區分代號前綴

source: Quit
zh_hans: 退出
zh_hant: 退出

# quitConfirm
source: Quit
zh_hans: 确定
zh_hant: 確定

# quitConfirmation
source: Are you sure you want to quit?
zh_hans: 确定退出?
zh_hant: 確定退出?

# relaunchForLanguage
source: The new language takes effect after FlowerPassword relaunches.
zh_hans: 新语言将在 FlowerPassword 重新启动后生效。
zh_hant: 新語言將在 FlowerPassword 重新啟動後生效。

source: Relaunch Now
zh_hans: 立即重启
zh_hant: 立即重新啟動

# shortcutRegistrationFailed
source: Failed to register global shortcut (%@). The shortcut may be already in use by another application.
zh_hans: 无法注册全局快捷键(%@)。该快捷键可能已被其他应用占用。
zh_hant: 無法註冊全域快速鍵(%@)。該快速鍵可能已被其他應用程式佔用。

source: Show
zh_hans: 显示
zh_hant: 顯示

# statusItemName
source: FlowerPassword
zh_hans: 花密
zh_hant: 花密

source: Suffix
zh_hans: 区分代号后缀
zh_hant: 區分代號後綴

source: Theme
zh_hans: 主题
zh_hant: 主題

# themeAuto
source: Auto
zh_hans: 自动
zh_hant: 自動

# themeDark
source: Dark
zh_hans: 深色
zh_hant: 深色

# themeLight
source: Light
zh_hans: 浅色
zh_hant: 淺色

# upToDate
source: You are using the latest version.
zh_hans: 您正在使用最新版本。
zh_hant: 您正在使用最新版本。

# updateAvailable
source: A new version is available! Current: %1$@ Latest: %2$@
zh_hans: 发现新版本! 当前版本:%1$@ 最新版本:%2$@
zh_hant: 發現新版本! 目前版本:%1$@ 最新版本:%2$@

# updateCheckFailed
source: Failed to check for updates.
zh_hans: 检查更新失败。
zh_hant: 檢查更新失敗。

# updateErrorAppMissing
source: The update archive does not contain an app bundle.
zh_hans: 更新包中没有找到应用程序。
zh_hant: 更新包中找不到應用程式。

# updateErrorExtraction
source: Could not extract the update archive (ditto exited with %lld).
zh_hans: 无法解压更新包(ditto 退出码 %lld)。
zh_hant: 無法解壓縮更新包(ditto 退出碼 %lld)。

# updateErrorHTTPStatus
source: Request failed with HTTP %lld.
zh_hans: 请求失败,HTTP 状态码 %lld。
zh_hant: 請求失敗,HTTP 狀態碼 %lld。

# updateErrorInvalidSignature
source: The update failed signature verification; the download may be corrupted or tampered with.
zh_hans: 更新包未通过签名校验,文件可能已损坏或被篡改。
zh_hant: 更新包未通過簽章驗證,檔案可能已損毀或遭竄改。

# updateErrorNotWritable
source: No permission to replace the app in %@.
zh_hans: 没有权限替换 %@ 中的应用。
zh_hant: 沒有權限替換 %@ 中的應用程式。

# updateErrorTooLarge
source: The download is %1$@, above the %2$@ limit.
zh_hans: 下载内容为 %1$@,超出 %2$@ 的上限。
zh_hant: 下載內容為 %1$@,超出 %2$@ 的上限。

# updateErrorTranslocated
source: The app is running from a translocated path. Move FlowerPassword.app to /Applications and try again.
zh_hans: 应用正在从隔离路径运行。请将 FlowerPassword.app 移动到「应用程序」文件夹后重试。
zh_hant: 應用程式正在從隔離路徑執行。請將 FlowerPassword.app 移動到「應用程式」資料夾後重試。

# updateErrorUnsafeVolume
source: The volume holding %@ ignores file ownership, so in-place updates are unsafe there.
zh_hans: %@ 所在的宗卷忽略文件归属权,在此处原地更新并不安全。
zh_hant: %@ 所在的儲存空間忽略檔案擁有權,在此處原地更新並不安全。

# updateErrorWrongBundle
source: The downloaded app failed validation: %@.
zh_hans: 下载的应用未通过校验:%@。
zh_hant: 下載的應用程式未通過驗證:%@。

# updateInstallDetail
source: The update will be downloaded, verified, and installed automatically; the app then relaunches.
zh_hans: 将自动下载并安装更新,完成后应用会自动重启。
zh_hant: 將自動下載並安裝更新,完成後應用程式會自動重啟。

# updateInstallFailed
source: Automatic update failed.
zh_hans: 自动更新失败。
zh_hant: 自動更新失敗。

# updateManualDetail
source: Click OK to open the download page in your browser.
zh_hans: 点击确定将打开浏览器,跳转到下载页面。
zh_hant: 點擊確定將開啟瀏覽器,跳轉至下載頁面。
